<a href="https://colab.research.google.com/github/shreshta97/DATA-690-WANG/blob/master/Assignment_06/Census_Cost_Redo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

## 1. Use Pandas read_html() function to retrive the HTML tables as dataframes from the web page: https://www.genealogybranches.com/censuscosts.html

In [6]:
df_list = pd.read_html("https://www.genealogybranches.com/censuscosts.html")
len(df_list)

2

## 2. Find out how many HTML tables Pandas retrieves from the web page. Find out which dataframe contain the data and use it for further processing.

In [7]:
df1 = df_list[0]
df1.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [8]:
df2 = df_list[1]
df2.head()

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

In [9]:
df1

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

## 3. Display and explore the data (rows, columns, etc.) and determine the data quality (bad rows, bad columns, bad elements, null values, etc.)

In [10]:
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [11]:
# define the first row as frist_row using iloc and index 0
first_row = df1.iloc[0]
first_row

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [12]:
# make the colums of data frame 1 equal to the first_row insted of 0-3
df1.columns = first_row
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [13]:
# df1 = df1.drop([0]) to remove the row 0 
df1.drop([0], inplace=True)
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

## 4. Document the data quality issues using a Markdown cell so the reader understands what the problems are.

In [14]:
df1

0  Census Year Total Population     Census Cost Average Cost Per Person
1         1790          3929214         $44,377              1.13 cents
2         1800          5308483         $66,109              1.24 cents
3         1810          7239881        $178,445              2.46 cents
4         1820          9633822        $208,526              2.16 cents
5         1830         12866020        $378,545              2.94 cents
6         1840         17069458        $833,371              4.88 cents
7         1850         23191876      $1,423,351              6.14 cents
8         1860         31443321      $1,969,377              6.26 cents
9         1870         38558371      $3,421,198              8.87 cents
10        1880         50155783      $5,790,678             11.54 cents
11        1890         62979766     $11,547,127             18.33 cents
12        1900         76303387     $11,854,000             15.54 cents
13        1910         91972266     $15,968,000             17.07 cents
14        1920        105710620     $25,117,000             23.76 cents
15        1930        122775046     $40,156,000             32.71 cents
16        1940        131669275     $67,527,000             51.29 cents
17        1950        151325798     $91,462,000             60.44 cents
18        1960        179323175    $127,934,000             71.34 cents
19        1970        203302031    $247,653,000                   $1.22
20        1980        226542199  $1,078,488,000                   $4.76
21        1990        248718301  $2,492,830,000                  $10.02
22        2000        281421906    $4.5 Billion                  $15.99
23       2010*        308745538     $13 Billion                  $42.11

# Data Quality issues: 
- (*) after 2010 in census year column 

- $ before each cost element in census cost column 

- Billion after 4.5 and 13 in Census cost column 

- cents after most values in avg cost per person column 

- $ before some values in avg cost per person column

## 5. Write a function named cleanse_year() that takes a string as input and removes any asterisks in the string and return the cleansed string. Test the function by using test strings (for example, "1989*", "20*10")

In [21]:
def clean_year(raw_year):
  
    ## If the value is a string, then remove * symbol 

    if isinstance(raw_year, str):
        return(raw_year.replace('*', '').replace(',', ''))
    return(raw_year)

## 6. Cleanse the column "Census Year" using the function cleanse_year() and Pandas's apply() function.

In [32]:
df1["new year"] = df1["Census Year"].apply(clean_year)
df1["new year"]

1     1790
2     1800
3     1810
4     1820
5     1830
6     1840
7     1850
8     1860
9     1870
10    1880
11    1890
12    1900
13    1910
14    1920
15    1930
16    1940
17    1950
18    1960
19    1970
20    1980
21    1990
22    2000
23    2010
Name: new year, dtype: object

## 7. Repeat this process for column "Total Population", "Census Cost", "Average Cost Per Person". (define, test, and apply the function)

In [30]:
def cleanse_cost(raw_cost):
    cost = raw_cost.lstrip("$").replace(",","")
    if  raw_cost.find("4.5") != -1:          # if "4.5" in raw_cost:
        cost = "45" + "0" * 8
    elif raw_cost.find("Billion") != -1:     # elif "Billion" in raw_cost: 
        cost = "13" + "0" * 9
    return cost

In [31]:
df1["new cost"] = df1["Census Cost"].apply(cleanse_cost)
df1["new cost"]

1           44377
2           66109
3          178445
4          208526
5          378545
6          833371
7         1423351
8         1969377
9         3421198
10        5790678
11       11547127
12       11854000
13       15968000
14       25117000
15       40156000
16       67527000
17       91462000
18      127934000
19      247653000
20     1078488000
21     2492830000
22     4500000000
23    13000000000
Name: new cost, dtype: object

In [ ]:
def cleanse_Avg_cost(raw_avg_cost):
    cost = raw_avg_cost.lstrip("$").replace("cents","")
    if  raw_avg_cost.find("$") != -1:          # if "4.5" in raw_cost:
        Avg_cost = "45" + "0" * 3
    elif raw_avg_cost.find("Billion") != -1:     # elif "Billion" in raw_cost: 
        Avg_cost = "13" + "0" * 9
    return Avg_cost

In [ ]:
def clean_avgcost(raw_avgcost):
  
    ## If the value is a string, then remove cents and $ symbol 

    if isinstance(raw_avgcost, str):
        return(raw_avgcost.replace('$', '').replace('cents', '').replace('.',''))
    return(raw_avgcos)

In [38]:
df1["new avgcost"] = df1["Average Cost Per Person"].apply(clean_avgcost)
df1["new avgcost"]

1      113
2      124
3      246
4      216
5      294
6      488
7      614
8      626
9      887
10    1154
11    1833
12    1554
13    1707
14    2376
15    3271
16    5129
17    6044
18    7134
19      122
20      476
21     1002
22     1599
23     4211
Name: new avgcost, dtype: object

## 8. After all columns are cleansed, save the clenased dataframe to a file named "census_cost_cleansed.csv" using CSV format.

In [57]:
df1['new year'].to_csv(r'census_cost_cleansed.csv', index = False)

In [56]:
df1['new cost'].to_csv(r'census_cost_cleansed2.csv', index = False)

In [58]:
df1['new avgcost'].to_csv(r'census_cost_cleansed3.csv', index = False)

In [ ]:
## exported 3 CSV files then merged into one using terminal